#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+title: land-of-lisp-notes
#+date: <2021-08-12 Thu>
#+author: rodnchr
#+email: rodnchr@ua6ff97dd3b1950.ant.amazon.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 28.0.50 (Org mode 9.4.6)
#+PROPERTY: header-args :results verbatim value replace
#+PROPERTY: header-args:dot :cmd neato
These are my notes while working through the LoL book, interpersed
with all of the code I copied during that work.

*** Arrays
    An /Array/ in Common Lisp is very similar to a list, but allows
    You to access any specific location's value using a constant
    amount of time.

    Creating an array is done through =make-array=. Note the syntax
    =#()=; The leading =#= indicates this is not just a list, but an
    array.

    #+begin_src lisp
      (make-array 3)
    #+end_src

    #+RESULTS:
    : #(0 0 0)


    It's not super-useful to declare an empty array, though, nor one
    that can't be used. More typical usage would be the following:

    #+begin_src lisp
      (defparameter x (make-array 3))
      (setf (aref x 0) 'fiz)
      (setf (aref x 1) 'foo)
      (setf (aref x 2) 'bar)
      (aref x 1)
    #+end_src

    #+RESULTS:
    : FOO

    The thing to take away here is the =aref= function: Though it
    usually /gets/ the value from an array, when used with =setf= in
    this way it actually /sets/ the value of the array. This is called
    a /Generic Setter/.
*** Working with Hash Tables
    You can create a new hash table with =make-hash-table=. Note the
    =#S= prefix; that indicates that it is a hash table. Actually,
    don't note that, because I got different output.

    #+begin_src lisp
      (make-hash-table)
    #+end_src

    #+RESULTS:
    : #<HASH-TABLE :TEST EQL :COUNT 0 {100478CB23}>

    Let's set up a variable hash table; maybe then it will show the
    =#S= marking.

    #+begin_src lisp
      (defparameter x (make-hash-table))
      (print x)
    #+end_src

    #+RESULTS:
    : #<HASH-TABLE :TEST EQL :COUNT 0 {10047F2E03}>

    Nope, it seems as though that is not in =sbcl=. Let's move on, see
    if it changes as we learn more.

    If we try to get the value of a key that is not present in the
    table, we instead get =NIL=. We actually get two =NIL= values: one
    for the value found (which, nothing was) and one for whether the
    /key/ was found (it was not).

    #+begin_src lisp
      (gethash 'yup x)
    #+end_src

    #+RESULTS:
    : NIL
    : NIL

    We can use the =gethash= command as a generalized reference to add
    items to our table, as well.

    #+begin_src lisp
      (setf (gethash 'yup x) 25)
      (gethash 'yup x)
    #+end_src

    #+RESULTS:
    : 25
    : T

    Note the 25 (the value found) and the =T= (whether the key was
    found).

    We can easily make a hash table of arbitrary size, this way.

    #+begin_src lisp
      (defparameter *drink-order* (make-hash-table))
      (setf (gethash 'bill *drink-order*) 'double-espresso)
      (setf (gethash 'lisa *drink-order*) 'small-drip-coffee)
      (setf (gethash 'john *drink-order*) 'medium-latte)
      (gethash 'lisa *drink-order*)
    #+end_src

    #+RESULTS:
    : SMALL-DRIP-COFFEE
    : T
*** Returning Multiple Values
    *Common Lisp allows you to return more than one value as a
    result*. We've seen =gethash= above. =round= is another function
    that does this; It rounds a number and returns it, and then
    returns the remainder of the rounding operation.

    #+begin_src lisp
      (round 2.4)
    #+end_src

    #+RESULTS:
    : 2
    : 0.4000001

    You can do the same thing in Your own code with the =values=
    function.

    #+begin_src lisp
      (defun foo ()
        (values 3 7))
      (foo)
    #+end_src

    #+RESULTS:
    : 3
    : 7

    The second value will be ignored by a lot of the functions You
    use; It will not impact the functionality of things at all from
    that perspective. Note that the following results in 8, because
    the 3 is used, and the 7 is ignored.

    #+begin_src lisp
      (+ (foo) 5)
    #+end_src

    #+RESULTS:
    : 8

    Of course, there's a way to get around this as well, with the
    function =multiple-value-bind=. It allows You to bind the values
    of

    #+begin_src lisp
      (multiple-value-bind (a b) (foo)
        (* a b))
    #+end_src

    #+RESULTS:
    : 21

    Many more recent Lisp Dialects don't support this
    feature. However, it can lead to more optimized, cleaner code, and
    is something You should remember is a possible alternative to
    simply returning a list of results.
*** Common Lisp Structures
    A /structure/ is an object with one or more /slots/, which allows
    for a uniform structure to the data You are working with.

    #+begin_src lisp
      (defstruct person
        name
        age
        waist-size
        favorite-color)
    #+end_src

    #+RESULTS:
    : PERSON

    The =defstruct= command has a few nice benefits to manually
    building something like it by hand, or without an object: First,
    it creates some of the otherwise repetetive functions for You:
    =make-object= is the constructor, =object-slot= are the
    getters/setters, etc.

    #+begin_src lisp
      (defparameter *bob* (make-person :name "Bob"
                                       :age 35
                                       :waist-size 32
                                       :favorite-color "blue"))
      (person-age *bob*)
      (setf (person-age *bob*) 36)
      (person-age *bob*)
      *bob*
    #+end_src

    #+RESULTS:
    : #S(PERSON :NAME "Bob" :AGE 36 :WAIST-SIZE 32 :FAVORITE-COLOR "blue")

    Note the =#S= prefix; this indicates a structure.

    Also note that we do not /need/ to use the constructor function;
    We can specify a structure in the form of the printed
    representation, too:

    #+begin_src lisp
      (defparameter *george* #S(person :name "George"
                                       :age 38
                                       :waist-size 36
                                       :favorite-color "black"))
      (person-age *george*)
    #+end_src

    #+RESULTS:
    : 38
**** =reduce=
     The =reduce= function iterates through a sequence and returns a
     single result.

     #+begin_src lisp
       (reduce #'+ '(3 4 6 5 2))
     #+end_src

     #+RESULTS:
     : 20

     Here's a more complex example, using an anonymous function and a
     parameter, =:initial-value=. Setting an explicit initial value
     like this is important, because otherwise =reduce= will use the
     first items in our sequence to fill all the arguments in our
     function. In this case, it would return 7—the largest number in
     our sequence, and the first number (so it would be used as the
     initial value for our =best= argument, and never be checked
     itself—instead of 6.

     #+begin_src lisp
       (reduce (lambda (best item)
                 (if (and (evenp item)
                          (> item best))
                     item
                     best))
               '(7 4 6 5 2)
               :initial-value 0)
     #+end_src

     #+RESULTS:
     : 6

     While =reduce= is generic across all sequences, the functions
     handed to =reduce= do not have to be:

     #+begin_src lisp
       (defun sum (lst)
         (reduce #'+ lst))
     #+end_src

     #+RESULTS:
     : SUM

     This =sum= function will work for all sequences that have numbers
     in them. However, it will give You a type error if any characters
     are in the sequence. This means strings don't work at all, and
     some arrays and lists won't either.

     #+begin_src lisp :results output
       (print (sum '(1 2 3)))
       (print (sum (make-array 5 :initial-contents '(1 2 3 4 5))))
     #+end_src

     #+RESULTS:
     : 
     : 6 
     : 15 

**** =map=
     Map works as I expect it to, with the wrinkle that the return
     type be specified as the first argument.

     #+begin_src lisp
       (map 'string (lambda (x)
                      (if (eq x #\c)
                          #\C
                          x))
            "My name is christopher.")
     #+end_src

     #+RESULTS:
     : My name is Christopher.

*** Two More Important Sequence Functions
    The =subseq= function slices the sequence using start and end
    points. And the =sort= function lets You pass a function to sort
    the sequence by.

    #+begin_src lisp
      (subseq "Tarot" 0 3)
    #+end_src

    #+RESULTS:
    : Tar

    #+begin_src lisp
      (sort '(5 8 2 4 9 3 6) #'<)
    #+end_src

    #+RESULTS:
    : (2 3 4 5 6 8 9)

    There are many more /sequence functions/, but these are a good
    starting point.

***** The Generic Monster
      We're going to start with a generic monster, and work our way
      out from there.

      The LCD for monsters is the health meter. Every Monster will
      have one. We're going to take advantage of a special feature: We
      can define default values for /slots/ using arbitrary forms!

      #+begin_src lisp :tangle orc-battle.lisp
        (defstruct monster (health (randval 10)))
      #+end_src

      #+RESULTS:
      : MONSTER

      If we try using the constructor =make-monster=, we see that the
      health is different every time.

      #+begin_src lisp
        (make-monster)
      #+end_src

      #+RESULTS:
      : #S(MONSTER :HEALTH 5)

      We also need a function to decrease a monster's health when
      attacked. We'll call that function =monster-hit=. It'll print a
      message, too, but we'll define it with =defmethod= so that we
      can print specific messages for various monsters.

      #+begin_src lisp :tangle orc-battle.lisp
        (defmethod monster-hit (m x)
          (decf (monster-health m) x)
          (if (monster-dead m)
              (progn (princ "You killed the ")
                     (princ (type-of m))
                     (princ "! "))
              (progn (princ "You hit the ")
                     (princ (type-of m))
                     (princ ", knocking off ")
                     (princ x)
                     (princ " health points! "))))
      #+end_src

      #+RESULTS:
      : #<STANDARD-METHOD COMMON-LISP-USER::MONSTER-HIT (T T) {10071DDFA3}>

      We also need two more smaller functions: =monster-show= and
      =monster-attack=. The former will be very simple, since it might
      be written over by a future (real) monster. The latter is empty;
      simply a placeholder since each monster will have a unique
      attack.

      #+begin_src lisp :tangle orc-battle.lisp
        (defmethod monster-show (m)
          (princ "A fierce ")
          (princ (type-of m))
          (princ ". "))
        (defmethod monster-attack (m))
      #+end_src

      #+RESULTS:
      : #<STANDARD-METHOD COMMON-LISP-USER::MONSTER-ATTACK (T) {1007286303}>
***** The Wicked Orc
      Orcs are simple: Strong, variable-strength club attack.

      We make the orc type using =defstruct=, using a feature that
      includes all of the fields of another type (our generic monster
      class. We just need to add a club-level, which will be
      orc-specific. And then we'll push the constructor onto
      =*monster-builders*=.

      #+begin_src lisp :tangle orc-battle.lisp
        (defstruct (orc (:include monster)) (club-level (randval 8)))
        (push #'make-orc *monster-builders*)
      #+end_src

      #+RESULTS:
      : (#<FUNCTION MAKE-ORC>)

      Note how simple the approach is: No matter how many monsters we
      add, we will never need to change our basic Orc Battle
      code. This is only possible in languages like Lisp, with
      dynamically typed variables and first-class functions.

      We'll now specialize =monster-show= and =monster-attack= for use
      with orcs.

      #+begin_src lisp :tangle orc-battle.lisp
        (defmethod monster-show ((m orc))
          (princ "A wicked orc with a level ")
          (princ (orc-club-level m))
          (princ " club."))
        (defmethod monster-attack ((m orc))
          (let ((x (randval (orc-club-level m))))
            (princ "An orc swings at You and knocks off ")
            (princ x)
            (princ " of Your health points. ")
            (decf *player-health* x)))
      #+end_src

      #+RESULTS:
      : #<STANDARD-METHOD COMMON-LISP-USER::MONSTER-ATTACK (ORC) {100404D743}>
***** The Malicious Hydra
      The hydra attacks with its heads, grows heads back each round,
      and should be dealt with quickly.

      #+begin_src lisp :tangle orc-battle.lisp
        (defstruct (hydra (:include monster)))
        (push #'make-hydra *monster-builders*)
      #+end_src

      #+RESULTS:
      : (#<FUNCTION MAKE-HYDRA> #<FUNCTION MAKE-ORC>)

     The hydra's health /is/ its number of heads. So, the healthier it
     is, the more damage it does. And it heals 1 HP each turn.

     #+begin_src lisp :tangle orc-battle.lisp
       (defmethod monster-show ((m hydra))
         (princ "A malicious hydra with ")
         (princ (monster-health m))
         (princ " heads."))
       (defmethod monster-hit ((m hydra) x)
         (decf (monster-health m) x)
         (if (monster-dead m)
             (princ "The corpse of the fully decapitated and decapacitated hydra falls to the floor!")
             (progn (princ "You lop off ")
                    (princ x)
                    (princ " of the hydra's heads! "))))
       (defmethod monster-attack ((m hydra))
         (let ((x (randval (ash (monster-health m) -1))))
           (princ "A hydra attacks You with ")
           (princ x)
           (princ " of its heads! It also grows back one more head! ")
           (incf (monster-health m))
           (decf *player-health* x)))
     #+end_src

     #+RESULTS:
     : #<STANDARD-METHOD COMMON-LISP-USER::MONSTER-ATTACK (HYDRA) {100434AA83}>
***** The Slimy Slime Mold
      This monster attacks Your agility by wrapping around Your legs
      and squirting goo in Your face.

      #+begin_src lisp :tangle orc-battle.lisp
        (defstruct (slime-mold (:include monster)) (sliminess (randval 5)))
        (push #'make-slime-mold *monster-builders*)
      #+end_src

      #+RESULTS:
      : (#<FUNCTION MAKE-SLIME-MOLD> #<FUNCTION MAKE-HYDRA> #<FUNCTION MAKE-ORC>)

      The main feature is the agility damage, but there is also a 50%
      chance it will do 1 HP of damage (squirting goo) to the player
      as well, to prevent softlocking.

      #+begin_src lisp :tangle orc-battle.lisp
        (defmethod monster-show ((m slime-mold))
          (princ "A slime mold with a sliminess of ")
          (princ (slime-mold-sliminess m))
          (princ ". "))
        (defmethod monster-attack ((m slime-mold))
          (let ((x (randval (slime-mold-sliminess m))))
            (princ "A slime mold wraps around Your legs and decreases Your agility by ")
            (princ x)
            (princ "! ")
            (decf *player-agility* x)
            (when (zerop (random 2))
              (princ "It also squirts in Your face, taking away a health point! ")
              (decf *player-health*))))
      #+end_src

      #+RESULTS:
      : #<STANDARD-METHOD COMMON-LISP-USER::MONSTER-ATTACK (SLIME-MOLD) {1004687213}>
***** The Cunning Brigand
      The smartest monster who attacks Your currently-best attribute.

      #+begin_src lisp :tangle orc-battle.lisp
        (defstruct (brigand (:include monster)))
        (push #'make-brigand *monster-builders*)
      #+end_src

      #+RESULTS:
      : (#<FUNCTION MAKE-BRIGAND> #<FUNCTION MAKE-SLIME-MOLD> #<FUNCTION MAKE-HYDRA>
      :  #<FUNCTION MAKE-ORC>)

      The brigand won't get a special show or hit function, but will
      have a fairly complex attack function.

      #+begin_src lisp :tangle orc-battle.lisp
        (defmethod monster-attack ((m brigand))
          (let ((x (max *player-health* *player-agility* *player-strength*)))
            (cond ((= x *player-health*)
                   (princ "A brigand hits You with their slingshot, taking off 2 health points! ")
                   (decf *player-health* 2))
                  ((= x *player-agility*)
                   (princ "A brigand catches Your leg with their whip, taking off 2 agility points! ")
                   (decf *player-agility* 2))
                  ((= x *player-strength*)
                   (princ "A brigand cuts Your arm with their whip, taking off 2 strength points! ")
                   (decf *player-strength* 2)))))
      #+end_src

      #+RESULTS:
      : #<STANDARD-METHOD COMMON-LISP-USER::MONSTER-ATTACK (BRIGAND) {10049022D3}>
*** The =loop= macro
    The first macro we are going over in this section is =loop=. It
    can do basically any kind of looping You could want.

    #+begin_src lisp
      (loop for i
            below 5
            sum i)
    #+end_src

    #+RESULTS:
    : 10

    This is, obviously, not a very lispy way to do such a thing,
    however. There are 7 tokens in a row, and 3 of them have special
    rules that break the symmetry expected in lisp forms:

    - =for= declares a variable that changes each iteration.
    - =below= is a constraint for that variable (stop at 5,
      exclusively).
    - =sum= adds together the number from each iteration, the sum of
      which will be returned by =loop=.
**** Counting from a Starting Point to an Ending Point
     The =from= and =to= clauses control starting and ending points.

     #+begin_src lisp
       (loop for i
             from 5
             to 10
             sum i)
     #+end_src

     #+RESULTS:
     : 45

**** Iterating Through Values in a List
     The =in= token lets You specify the data set.

     #+begin_src lisp
       (loop for i
             in '(100 20 3)
             sum i)
     #+end_src

     #+RESULTS:
     : 123

**** Doing Stuff Under Certain Conditions
     The =when= token only runs when a predicate is true.

     #+begin_src lisp
       (loop for i
             below 10
             when (oddp i)
               sum i)
     #+end_src

     #+RESULTS:
     : 25

**** Collecting a List of Values
     The =collect= token builds a list from the results of a function
     in each iteration. Useful for transforming each member of a list.

     #+begin_src lisp
       (loop for i
             in '(2 3 4 5 6)
             collect (* i i))
     #+end_src

     #+RESULTS:
     : (4 9 16 25 36)

**** Using Multiple =for= Clauses
     You can use more than one =for= token, too. Note, however, that
     the variables iterate in tandem, not separately.

     #+begin_src lisp
       (loop for x below 10
             for y below 10
             collect (+ x y))
     #+end_src

     #+RESULTS:
     : (0 2 4 6 8 10 12 14 16 18)

     To get the other kind of result, called a /Cartesian Product/, we
     need to use /nested =loop= statements/.

     #+begin_src lisp
       (loop for x below 10
             collect (loop for y below 10
                           collect (+ x y)))
     #+end_src

     #+RESULTS:
     : ((0 1 2 3 4 5 6 7 8 9) (1 2 3 4 5 6 7 8 9 10) (2 3 4 5 6 7 8 9 10 11)
     :  (3 4 5 6 7 8 9 10 11 12) (4 5 6 7 8 9 10 11 12 13) (5 6 7 8 9 10 11 12 13 14)
     :  (6 7 8 9 10 11 12 13 14 15) (7 8 9 10 11 12 13 14 15 16)
     :  (8 9 10 11 12 13 14 15 16 17) (9 10 11 12 13 14 15 16 17 18))

     Also note how easy tracking the index of a list is since the
     default for =for= variables is to start at zero:

     #+begin_src lisp
       (loop for i
             from 0
             for day
             in '(monday tuesday wednesday thursday friday saturday sunday)
             collect (cons i day))
     #+end_src

     #+RESULTS:
     : ((0 . MONDAY) (1 . TUESDAY) (2 . WEDNESDAY) (3 . THURSDAY) (4 . FRIDAY)
     :  (5 . SATURDAY) (6 . SUNDAY))

*** Anatomy of the =format= function
    Here is an example.

    #+begin_src lisp :results output
      (format t "Add onion rings for only ~$ dollars more!" 1.5)
    #+end_src

    #+RESULTS:
    : Add onion rings for only 1.50 dollars more!
**** The Destination Parameter
     The first argument to =format= is the /destination/
     parameter. Possible values:

     - =nil=: Don't print anything, just return the string.
     - =t=: Print the value to stdout, returning =nil=.
     - =stream=: Write data to specific /Output Stream/, which is
       something we'll learn about in Chapter 12.


     In the example above, we have this set to =t= so it will spit the
     formatted string back to us on the console.

     In the following example, it is set to =nil= so we can manipulate
     the string more before =princ= ing it.

     #+begin_src lisp :results output
       (princ
        (reverse
         (format nil "Add onion rings for only ~$ dollars more!" 1.5)))
     #+end_src

     #+RESULTS:
     : !erom srallod 05.1 ylno rof sgnir noino ddA
*** Control Sequences for Printing Lisp Values
    Any Lisp value can be printed with the =print= or =prin1=
    functions, and for humans with the =princ= command.

    The =format= function has control sequences for these effects, as
    well. =~s= causes the value to be printed as in =print=, with
    appropriate delimiters. And =~a= causes the value to be printed as
    appropriate for humans to read, like =princ=.

    #+begin_src lisp :results output
      (format t "I am printing ~s in the middle of this sentence." "foo")
      (fresh-line)
      (format t "I am printing ~a in the middle of this sentence." "foo")
    #+end_src

    #+RESULTS:
    : I am printing "foo" in the middle of this sentence.
    : I am printing foo in the middle of this sentence.

    You can adjust control sequence behavior with parameters embedded
    within the control sequence itself. For instance, adding a number
    to =~a= we can pad the value, ensuring it is a specific width. To
    add on the left instead of the right, add an =@= at the end of the
    parameter list. And to specify how many spaces should be the
    minimum group used for padding (if You want to pad with a multiple
    of 3 spaces only, for instance), that is the job of the second
    parameter of =~a=, and comes after a comma, but before the =@= if
    using.

    #+begin_src lisp :results output
      (format t "I am printing ~10a within 10 spaces of room." "foo")
      (fresh-line)
      (format t "I am printing ~10@a within 10 spaces of room." "foo")
      (fresh-line)
      (format t "I am printing ~10,3@a within a multiple of 3 spaces of room." "foo")
    #+end_src

    #+RESULTS:
    : I am printing foo        within 10 spaces of room.
    : I am printing        foo within 10 spaces of room.
    : I am printing          foo within a multiple of 3 spaces of room.

    The third parameter specifies the amount of padding we want at the
    end of the term, explicitly. And the fourth specifies the
    character to use for padding.

    #+begin_src lisp :results output
      (format t "I am printing ~,,4a in the middle of this sentence." "foo")
      (fresh-line)
      (format t "The world ~,,4,'!a feels very important, too." "foo")
    #+end_src

    #+RESULTS:
    : I am printing foo     in the middle of this sentence.
    : The world foo!!!! feels very important, too.
**** Control Sequences for Formatting Integers
     You can display numbers in hexidecimal =~x=, binary =~b=, and
     decimal =~d=.

     #+begin_src lisp :results output
       (format t "The number ~d is ~x in hexadecimal and ~b in binary." 1464 1464 1464)
     #+end_src

     #+RESULTS:
     : The number 1464 is 5B8 in hexadecimal and 10110111000 in binary

     You can pad like with =~a=, though the /second/ parameter is the
     padding character. And You can turn on commas for separation with
     the finale character =:=.

     #+begin_src lisp :results output
       (format t "Numbers with commas in them are ~10,',:d times better." 10000)
     #+end_src

     #+RESULTS:
     : Numbers with commas in them are ,,,,10,000 times better.
**** Control Sequences for Formatting Floating-Point Numbers
     All floating point numbers can be handled with =~f=. The first
     parameter is the number of characters to display. The second is
     the number /after the decimal/. The third multiplies the result
     by powers of 10 (letting us use E notation easily). And as we saw
     above, =~$= handles money-style numbers (with exactly two digits
     after the decimal).

     #+begin_src lisp :results output
       (defparameter lightspeed 299792458)
       (format t "PI Can be estimated as ~4f for speed and ~,4f for accuracy." pi pi)
       (fresh-line)
       (format t "The speed of light is ~,,-8f x 10^8 m/s in scientific notation, but ~,,-6f m/s in engineering notation." lightspeed lightspeed)
     #+end_src

     #+RESULTS:
     : PI Can be estimated as 3.14 for speed and 3.1416 for accuracy.
     : The speed of light is 2.9979245 x 10^8 m/s in scientific notation, but 299.79245 m/s in engineering notation.

*** Printing Multiple Lines of Output
    There are two functions for inserting newlines in stdout: =terpri=
    and =fresh-line=.

    The difference is that =terpri= will always insert a
    newline. =fresh-line= will only do so if You aren't already at the
    beginning of a line.

    =format= has similar control sequences: =~%= is like =terpri=, and
    =~&= is like =fresh-line=.

    #+begin_src lisp :results output
      (format t "This is on one line~%")
      (format t "~%This is on another line, after two terpri.")
      (fresh-line)
      (format t "This is on one line~&")
      (format t "~&This is on another line, after two fresh-line.")
    #+end_src

    #+RESULTS:
    : This is on one line
    : 
    : This is on another line, after two terpri.
    : This is on one line
    : This is on another line, after two fresh-line.

    There is only one parameter for these, and that is the number of
    newlines that should be inserted. There is no difference in this
    use-case.

    #+begin_src lisp :results output
      (format t "This will Print~5%On a Few~5&Lines I Think.")
    #+end_src

    #+RESULTS:
    #+begin_example
    This will Print




    On a Few




    Lines I Think.
    #+end_example

*** Justifying Output
    We're going to return some random text to illustrate the
    justification rules.

    #+begin_src lisp
      (defun random-animal ()
        (nth (random 5) '("dog" "tick" "tiger" "walrus" "kangaroo")))
    #+end_src

    #+RESULTS:
    : RANDOM-ANIMAL

    We can use the =~t= control sequence to display data in a uniform
    table-line format. It takes a parameter that will specify which
    character column the info should be placed in. The following
    example works because our longest value, "kangaroo", is shorter
    than the space between our columns (it is 8 characters, the space
    is 10).

    #+begin_src lisp :results output
      (loop repeat 10
            do (format t "~5t~a ~15t~a ~25t~a~%"
                        (random-animal)
                        (random-animal)
                        (random-animal)))
    #+end_src

    #+RESULTS:
    #+begin_example
         tick      tick      tiger
         walrus    kangaroo  tiger
         walrus    tick      dog
         walrus    tiger     tick
         walrus    tiger     tiger
         dog       walrus    tick
         tick      tiger     dog
         tick      tick      walrus
         dog       tick      tick
         tiger     tick      walrus
    #+end_example

    We can do this differently using the =~<= and =~>= control
    sequences.

    Deconstructing the full control string of =~30<~a~;~a~;~a~>~%=:

    - =~30<=: Start Justifying =~<=. Parameter 30 means it should be
      30 character wide in total.
    - =~a=: Place a Value Here.
    - =~;=: Start a New Item to Justify.
    - =~>=: Stop Justifying.
    - =~%=: =terpri=.

    #+begin_src lisp :results output
      (loop repeat 10
            do (format t "~30<~a~;~a~;~a~>~%"
                       (random-animal)
                       (random-animal)
                       (random-animal)))
    #+end_src

    #+RESULTS:
    #+begin_example
    tick         dog         tiger
    walrus    kangaroo    kangaroo
    kangaroo       dog        tick
    walrus     kangaroo     walrus
    dog         dog          tiger
    tiger      tick       kangaroo
    tiger        tick         tick
    walrus    kangaroo    kangaroo
    tick      kangaroo       tiger
    tiger        tick         tick
    #+end_example

    We can center values by appending the finale character =:@= to the
    original Justify control sequence.

    #+begin_src lisp :results output
      (loop repeat 10 do (format t "~30:@<~a~>~%" (random-animal)))
    #+end_src

    #+RESULTS:
    #+begin_example
                 tick             
                tiger             
                tiger             
                 tick             
                walrus            
                 tick             
                 dog              
                walrus            
                 dog              
                 tick             
    #+end_example

    This also works for mutiple values in a line.

    #+begin_src lisp :results output
      (loop repeat 10
            do (format t "~30:@<~a~;~a~;~a~>~%"
                       (random-animal)
                       (random-animal)
                       (random-animal)))

    #+end_src

    #+RESULTS:
    #+begin_example
       kangaroo   walrus   dog    
       walrus   walrus   tiger    
        dog    dog     walrus     
       walrus   walrus   tiger    
        walrus    dog     dog     
      kangaroo  kangaroo  walrus  
        tiger     dog     dog     
       walrus    tick    tiger    
        walrus    dog    tick     
         tick     dog     dog     
    #+end_example

    To get nicely-centered columns, we need to justify the columns
    separately. Dividing our original 30 character space into three
    separate 10 character spaces should nicely do the trick.

    #+begin_src lisp :results output
      (loop repeat 10
            do (format t "~10:@<~a~>~10:@<~a~>~10:@<~a~>~%"
                       (random-animal)
                       (random-animal)
                       (random-animal)))

    #+end_src

    #+RESULTS:
    #+begin_example
      walrus     dog       dog    
       dog       dog     kangaroo 
      walrus     tick     tiger   
      walrus     dog       dog    
     kangaroo  kangaroo   walrus  
     kangaroo  kangaroo    dog    
       dog      walrus   kangaroo 
     kangaroo  kangaroo    dog    
     kangaroo    tick     walrus  
       dog      tiger      tick   
    #+end_example

    There we go.

    Let's say we wanted the left column left justified, the right
    right-justified, and the center centered? Well, =:= does things on
    the right, and =@= on the left. Together, they center. Easy
    enough.

    #+begin_src lisp :results output
      (loop repeat 10
            do (format t "~10@<~a~>~10:@<~a~>~10:<~a~>~%"
                       (random-animal)
                       (random-animal)
                       (random-animal)))
    #+end_src

    #+RESULTS:
    #+begin_example
    kangaroo   kangaroo     walrus
    tick         tick         tick
    kangaroo     tick         tick
    kangaroo     tick         tick
    kangaroo     tick          dog
    dog          tick     kangaroo
    kangaroo    walrus      walrus
    walrus       tick          dog
    kangaroo   kangaroo        dog
    walrus      walrus       tiger
    #+end_example

*** Iterating Through Lists Using Control Sequences
    The =format= function has so many features some people consider it
    to be a DSL. We'll go over DSLs more in Chapter 17.

    Like most programming languages, =format= can loop through
    data. This is done with =~{= and =~}=.

    #+begin_src lisp
      (defparameter *zoo* (loop repeat 10 collect (random-animal)))
    #+end_src

    #+RESULTS:
    : *ZOO*

    To go to the =*zoo*=, we can loop over the =*zoo*= using our
    control sequences.

    #+begin_src lisp :results output
      (format t "~{I see a ~a!~&~}" *zoo*)
    #+end_src

    #+RESULTS:
    #+begin_example
    I see a kangaroo!
    I see a tick!
    I see a walrus!
    I see a tick!
    I see a kangaroo!
    I see a dog!
    I see a kangaroo!
    I see a tick!
    I see a tick!
    I see a dog!
    #+end_example

    We can also do more than one item from the list per iteration.

    #+begin_src lisp :results output
      (format t "~{I see a ~a... or was it a ~a?~&~}" *zoo*)
    #+end_src

    #+RESULTS:
    : I see a kangaroo... or was it a tick?
    : I see a walrus... or was it a tick?
    : I see a kangaroo... or was it a dog?
    : I see a kangaroo... or was it a tick?
    : I see a tick... or was it a dog?

    However, there need to be enough items in the list to fully
    satisfy all of the control structures in an iteration. So, the
    above wouldn't work with an odd number in our =*zoo*=.

*** A Crazy Formatting Sequence for Creating Pretty Tables of Data
    As one last example, we're going to dissect a long control string
    to show 100 numbers in a pretty-printed table.

    Deconstructing the full control string of =|~{~<|~%|~,33:;~2d
    ~>~}|=:

    - =|=: We start by drawing our first pipe.
    - =~{=: Begin loop.
    - =~<=: Begin justification.
    - =|~%|=: A piece of the control string to be applied after a
      limit is reached.
    - =~,33:;=: The limit is 33 characters.
    - =~2d=: Display numbers, padding with space up to two digits.
    - =~>=: End Justification.
    - =~}=: End Loop.
    - =|=: Final Pipe.


    It's worth noting how this adapts to changes in the =~,33:;=
    sequence: If You increase it, the table will be adjusted to
    include more numbers in a row, but only every three times it's
    increased. It really is behaving as a limit before which the
    =|~%|= string is added.

    #+begin_src lisp :results output
      (format t "|~{~<|~%|~,33:;~2d ~>~}|" (loop for x below 100 collect x))
    #+end_src

    #+RESULTS:
    #+begin_example
    | 0  1  2  3  4  5  6  7  8  9 |
    |10 11 12 13 14 15 16 17 18 19 |
    |20 21 22 23 24 25 26 27 28 29 |
    |30 31 32 33 34 35 36 37 38 39 |
    |40 41 42 43 44 45 46 47 48 49 |
    |50 51 52 53 54 55 56 57 58 59 |
    |60 61 62 63 64 65 66 67 68 69 |
    |70 71 72 73 74 75 76 77 78 79 |
    |80 81 82 83 84 85 86 87 88 89 |
    |90 91 92 93 94 95 96 97 98 99 |
    #+end_example

